uhnp/src/AccumulationRegisters/АмортизацияОС/АмортизацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АмортизацияОС</name>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияНУ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияПР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияВР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияНУЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияПРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияВРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиАмортизации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиАмортизацииРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаТекущийПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаПрошлыйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаТекущийПериодБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаПрошлыйПериодБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокОбесцененияУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокОбесцененияРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоначисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоначислениеБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаУУ</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаБУ</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокНачисленияАмортизацииУУ</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокНачисленияАмортизацииБУ</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьИзнос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/AccumulationRegisters/АмортизацияОС/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	// Текущее состояние набора помещается во временную таблицу,
	// чтобы при записи получить изменение нового набора относительно текущего.
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.ВидДвижения КАК ВидДвижения,
	|	Таблица.Организация КАК Организация,
	|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|	Таблица.Подразделение КАК Подразделение,
	|	Таблица.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Таблица.Амортизация КАК Амортизация,
	|	Таблица.АмортизацияРегл КАК АмортизацияРегл,
	|	Таблица.АмортизацияНУ КАК АмортизацияНУ,
	|	Таблица.АмортизацияПР КАК АмортизацияПР,
	|	Таблица.АмортизацияВР КАК АмортизацияВР,
	|	Таблица.АмортизацияЦФ КАК АмортизацияЦФ,
	|	Таблица.АмортизацияНУЦФ КАК АмортизацияНУЦФ,
	|	Таблица.АмортизацияПРЦФ КАК АмортизацияПРЦФ,
	|	Таблица.АмортизацияВРЦФ КАК АмортизацияВРЦФ,
	|	Таблица.РезервПереоценкиАмортизации КАК РезервПереоценкиАмортизации,
	|	Таблица.РезервПереоценкиАмортизацииРегл КАК РезервПереоценкиАмортизацииРегл
	|ПОМЕСТИТЬ АмортизацияОСПередЗаписью
	|ИЗ
	|	РегистрНакопления.АмортизацияОС КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И (Таблица.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|		ИЛИ Таблица.Регистратор ССЫЛКА Документ.ВводОстатковУзловКомпонентовАмортизации
	|		ИЛИ Таблица.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|		ИЛИ Таблица.Регистратор ССЫЛКА Документ.АмортизацияОС2_4)";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТаблицаИзменений.Период, МЕСЯЦ) КАК Период,
	|	ТаблицаИзменений.Организация КАК Организация,
	|	ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|	ИСТИНА КАК ОтражатьВРеглУчете,
	|	ИСТИНА КАК ОтражатьВУпрУчете,
	|	&Регистратор КАК Документ
	|ПОМЕСТИТЬ АмортизацияОСИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.ВидДвижения КАК ВидДвижения,
	|		Таблица.Организация КАК Организация,
	|		Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.Амортизация КАК Амортизация,
	|		Таблица.АмортизацияРегл КАК АмортизацияРегл,
	|		Таблица.АмортизацияНУ КАК АмортизацияНУ,
	|		Таблица.АмортизацияПР КАК АмортизацияПР,
	|		Таблица.АмортизацияВР КАК АмортизацияВР,
	|		Таблица.АмортизацияЦФ КАК АмортизацияЦФ,
	|		Таблица.АмортизацияНУЦФ КАК АмортизацияНУЦФ,
	|		Таблица.АмортизацияПРЦФ КАК АмортизацияПРЦФ,
	|		Таблица.АмортизацияВРЦФ КАК АмортизацияВРЦФ,
	|		Таблица.РезервПереоценкиАмортизации КАК РезервПереоценкиАмортизации,
	|		Таблица.РезервПереоценкиАмортизацииРегл КАК РезервПереоценкиАмортизацииРегл
	|	ИЗ
	|		РегистрНакопления.АмортизацияОС КАК Таблица
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор
	|		И (Таблица.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|			ИЛИ Таблица.Регистратор ССЫЛКА Документ.ВводОстатковУзловКомпонентовАмортизации
	|			ИЛИ Таблица.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|			ИЛИ Таблица.Регистратор ССЫЛКА Документ.АмортизацияОС2_4)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период,
	|		Таблица.ВидДвижения,
	|		Таблица.Организация,
	|		Таблица.ОсновноеСредство,
	|		Таблица.Подразделение,
	|		Таблица.ГруппаФинансовогоУчета,
	|		Таблица.НаправлениеДеятельности,
	|		-Таблица.Амортизация,
	|		-Таблица.АмортизацияРегл,
	|		-Таблица.АмортизацияНУ,
	|		-Таблица.АмортизацияПР,
	|		-Таблица.АмортизацияВР,
	|		-Таблица.АмортизацияЦФ,
	|		-Таблица.АмортизацияНУЦФ,
	|		-Таблица.АмортизацияПРЦФ,
	|		-Таблица.АмортизацияВРЦФ,
	|		-Таблица.РезервПереоценкиАмортизации,
	|		-Таблица.РезервПереоценкиАмортизацииРегл
	|	ИЗ
	|		АмортизацияОСПередЗаписью КАК Таблица) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Период,
	|	ТаблицаИзменений.ВидДвижения,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство,
	|	ТаблицаИзменений.Подразделение,
	|	ТаблицаИзменений.ГруппаФинансовогоУчета,
	|	ТаблицаИзменений.НаправлениеДеятельности
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаИзменений.Амортизация) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.АмортизацияРегл) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.АмортизацияНУ) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.АмортизацияПР) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.АмортизацияВР) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.АмортизацияЦФ) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.АмортизацияНУЦФ) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.АмортизацияПРЦФ) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.АмортизацияВРЦФ) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.РезервПереоценкиАмортизации) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.РезервПереоценкиАмортизацииРегл) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АмортизацияОСПередЗаписью";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(ДополнительныеСвойства,
		"АмортизацияОСИзменение", Выборка.Следующий() И Выборка.Количество > 0);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
